import random as r
import os

'''
cartas = "🂱 🂲 🂳 🂴 🂵 🂶 🂷 🂸 🂹 🂺 🂻 🂼 🂽 🂾 🂡 🂢 🂣 🂤 🂥 🂦 🂧 🂨 🂩 🂪 🂫 🂬 🂭 🂮 🃁 🃂 🃃 🃄 🃅 🃆 🃇 🃈 🃉 🃊 🃋 🃌 🃍 🃎 🃑 🃒 🃓 🃔 🃕 🃖 🃗 🃘 🃙 🃚 🃛 🃜 🃝 🃞"
res = '['
for i in cartas:
    if i != ' ':
        res += "'" + i + "', "
res += ']'

print(res)
'''

carta_vacia = '🂠'
nro = 0
entrada = ''

cartas = ['🂱', '🂲', '🂳', '🂴', '🂵', '🂶', '🂷', '🂸', '🂹', '🂺', '🂻', '🂼', '🂽', '🂾', '🂡', '🂢', '🂣', '🂤', '🂥', '🂦', '🂧', '🂨', '🂩', '🂪', '🂫', '🂬', '🂭', '🂮', '🃁', '🃂', '🃃', '🃄', '🃅', '🃆', '🃇', '🃈', '🃉', '🃊', '🃋', '🃌', '🃍', '🃎', '🃑', '🃒', '🃓', '🃔', '🃕', '🃖', '🃗', '🃘', '🃙', '🃚', '🃛', '🃜', '🃝', '🃞']

numeros = []
for i in range(1, len(cartas) + 1):
    numeros.append(i)

while entrada != 'f':
    
    os.system('clear')
    nro = r.randint(1, 56)
    print(cartas[nro] + ' ' + carta_vacia)
    print()
    entrada = input('Ingrese una apuesta: ')
    print()



